<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml"
      xmlns:og="http://ogp.me/ns#"
      xmlns:fb="https://www.facebook.com/2008/fbml">

<!-- Mirrored from eli.thegreenplace.net/2013/12/05/the-cost-of-dynamic-virtual-calls-vs-static-crtp-dispatch-in-c by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 17 Feb 2025 00:01:28 GMT -->
<head>
    <title>The cost of dynamic (virtual calls) vs. static (CRTP) dispatch in C++ - Eli Bendersky's website</title>
    <!-- Using the latest rendering mode for IE -->
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <link href="../../../favicon.ico" rel="icon">

    <!-- Bootstrap -->
        <link rel="stylesheet" href="../../../theme/css/bootstrap.min.css" type="text/css"/>
    <link href="../../../theme/css/font-awesome.min.css" rel="stylesheet">

    <link href="../../../theme/css/pygments/vs.css" rel="stylesheet">
    <link rel="stylesheet" href="../../../theme/css/style.css" type="text/css"/>

        <link href="../../../feeds/all.atom.xml" type="application/atom+xml" rel="alternate"
              title="Eli Bendersky's website ATOM Feed"/>

</head>
<body>

<div class="navbar navbar-default navbar-fixed-top" role="navigation">
    <div class="container">
        <div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-ex1-collapse">

<h3>Generated code - how virtual calls look under the hood</h3>
<p>Now let's spend some time studying the machine code generated by gcc -O2 (version 4.8) from the code above. The code for <tt class="docutils literal"><span class="pre">DynamicImplementation::tick</span></tt> is very compact:</p>
<div class="highlight" style="background: #ffffff"><pre style="line-height: 125%"><span style="color: #007f7f">0000000000400</span>cf0 &lt;_ZN21DynamicImplementation4tickEm&gt;:
  <span style="color: #007f7f">400</span>cf0:       add    %rsi,<span style="color: #007f7f">0x8</span>(%rdi)
  <span style="color: #007f7f">400</span>cf4:       retq
</pre></div>
<p>To understand what this means, some familiarity with the <a class="reference external" href="http://mentorembedded.github.io/cxx-abi/abi.html">Itanium C++ ABI</a> is required. The ABI in this case mandates both the name mangling that produces the weird symbol name, and the layout of the object in memory, which mandates how its fields are accessed. Here's a short description for the code above:</p>
<p>Since <tt class="docutils literal">DynamicInterface</tt> has virtual methods, the class hierarchy it begets comes with a virtual method table, a pointer to which resides in each object. This is the way the compiler arranges for the runtime code to call the correct method when an actual object is used. The address of the virtual method table (<tt class="docutils literal">vptr</tt>) is in the beginning of the object, and the actual class members come afterwards. So <tt class="docutils literal">counter</tt> lives at offset 8 in <tt class="docutils literal">DynamicImplementation</tt> objects.</p>
<div class="highlight" style="background: #ffffff"><pre style="line-height: 125%">add    %rsi,<span style="color: #007f7f">0x8</span>(%rdi)
</pre></div>
<p><tt class="docutils literal">%rdi</tt> is the first argument to <tt class="docutils literal">tick</tt>, which is the hidden <tt class="docutils literal">this</tt> pointer - the address of the object. Hence <tt class="docutils literal"><span class="pre">0x8(%rdi)</span></tt> is the address of <tt class="docutils literal"><span class="pre">this-&gt;counter</span></tt>. The instruction, then, adds <tt class="docutils literal">n</tt> (passed in <tt class="docutils literal">%rsi</tt> according to the calling convention) to <tt class="docutils literal"><span class="pre">this-&gt;counter</span></tt>.</p>
<p>By the way, whenever you're curious about object layouts and want to verify your understanding of the ABI, I find <a class="reference external" href="../../../2012/12/17/dumping-a-c-objects-memory-layout-with-clang/index.html">Clang's ability to dump the class record layouts</a> very helpful. In this case:</p>
<div class="highlight" style="background: #ffffff"><pre style="line-height: 125%">*** Dumping AST Record Layout
   0 | class DynamicImplementation
   0 |   class DynamicInterface (primary base)
   0 |     (DynamicInterface vtable pointer)
   8 |   uint64_t counter
     | [sizeof=16, dsize=16, align=8
     |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
   0 | class CRTPImplementation
   0 |   class CRTPInterface&lt;class CRTPImplementation&gt; (base) (empty)
   0 |   uint64_t counter
     | [sizeof=8, dsize=8, align=8
     |  nvsize=8, nvalign=8]
</pre></div>
<p>On to the invocation of <tt class="docutils literal">tick</tt> now. This is the disassembly for <tt class="docutils literal">run_dynamic</tt>, annotated with comments:</p>
<div class="highlight" style="background: #ffffff"><pre style="line-height: 125%"><span style="color: #007f7f">0000000000400</span>c10 &lt;_Z11run_dynamicP16DynamicInterface&gt;:
  <span style="color: #007f7f">400</span>c10:       push   %r13
  <span style="color: #007f7f">400</span>c12:       mov    $0x1,%r13d
  <span style="color: #007f7f">400</span>c18:       push   %r12
        <span style="color: #007f00">// r12d holds i, initialized to 0</span>
  <span style="color: #007f7f">400</span>c1a:       xor    %r12d,%r12d
  <span style="color: #007f7f">400</span>c1d:       push   %rbp
        <span style="color: #007f00">// Place obj in %rbp</span>
  <span style="color: #007f7f">400</span>c1e:       mov    %rdi,%rbp
