<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom"><title>Eli Bendersky's website - Assembly</title><link href="https://eli.thegreenplace.net/" rel="alternate"></link><link href="https://eli.thegreenplace.net/feeds/assembly.atom.xml" rel="self"></link><id>https://eli.thegreenplace.net/</id><updated>2024-09-14T13:15:30-07:00</updated><entry><title>WebAssembly Text code samples</title><link href="https://eli.thegreenplace.net/2023/webassembly-text-code-samples/" rel="alternate"></link><published>2023-04-22T07:46:00-07:00</published><updated>2023-04-22T14:49:03-07:00</updated><author><name>Eli Bendersky</name></author><id>tag:eli.thegreenplace.net,2023-04-22:/2023/webassembly-text-code-samples/</id><summary type="html">&lt;p&gt;This post talks about writing WebAssembly by hand (using its textual format),
and mentions a new GitHub &lt;a class="reference external" href="https://github.com/eliben/wasm-wat-samples/"&gt;repository&lt;/a&gt; I've created with code samples.&lt;/p&gt;
&lt;p&gt;A bit of nomenclature first. &lt;strong&gt;WASM&lt;/strong&gt; stands for WebAssembly - it has a &lt;a class="reference external" href="https://webassembly.github.io/spec/core/binary/index.html"&gt;binary
format&lt;/a&gt; and a
&lt;a class="reference external" href="https://webassembly.github.io/spec/core/text/index.html"&gt;textual format&lt;/a&gt;.

&lt;div class="highlight" style="background: #ffffff"&gt;&lt;pre style="line-height: 125%"&gt;&lt;span style="color: #007f7f"&gt;0000000000400&lt;/span&gt;cf0 &amp;lt;_ZN21DynamicImplementation4tickEm&amp;gt;:
  &lt;span style="color: #007f7f"&gt;400&lt;/span&gt;cf0:       add    %rsi,&lt;span style="color: #007f7f"&gt;0x8&lt;/span&gt;(%rdi)
  &lt;span style="color: #007f7f"&gt;400&lt;/span&gt;cf4:       retq
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;To understand what this means, some familiarity with the &lt;a class="reference external" href="http://mentorembedded.github.io/cxx-abi/abi.html"&gt;Itanium C++ ABI&lt;/a&gt; is required. The ABI in this case mandates both the name mangling that produces the weird symbol name, and the layout of the object in memory, which mandates how its fields are accessed. Here's a short description for the code above:&lt;/p&gt;
&lt;p&gt;Since &lt;tt class="docutils literal"&gt;DynamicInterface&lt;/tt&gt; has virtual methods, the class hierarchy it begets comes with a virtual method table, a pointer to which resides in each object. This is the way the compiler arranges for the runtime code to call the correct method when an actual object is used. The address of the virtual method table (&lt;tt class="docutils literal"&gt;vptr&lt;/tt&gt;) is in the beginning of the object, and the actual class members come afterwards. So &lt;tt class="docutils literal"&gt;counter&lt;/tt&gt; lives at offset 8 in &lt;tt class="docutils literal"&gt;DynamicImplementation&lt;/tt&gt; objects.&lt;/p&gt;
&lt;div class="highlight" style="background: #ffffff"&gt;&lt;pre style="line-height: 125%"&gt;add    %rsi,&lt;span style="color: #007f7f"&gt;0x8&lt;/span&gt;(%rdi)
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;&lt;tt class="docutils literal"&gt;%rdi&lt;/tt&gt; is the first argument to &lt;tt class="docutils literal"&gt;tick&lt;/tt&gt;, which is the hidden &lt;tt class="docutils literal"&gt;this&lt;/tt&gt; pointer - the address of the object. Hence &lt;tt class="docutils literal"&gt;&lt;span class="pre"&gt;0x8(%rdi)&lt;/span&gt;&lt;/tt&gt; is the address of &lt;tt class="docutils literal"&gt;&lt;span class="pre"&gt;this-&amp;gt;counter&lt;/span&gt;&lt;/tt&gt;. The instruction, then, adds &lt;tt class="docutils literal"&gt;n&lt;/tt&gt; (passed in &lt;tt class="docutils literal"&gt;%rsi&lt;/tt&gt; according to the calling convention) to &lt;tt class="docutils literal"&gt;&lt;span class="pre"&gt;this-&amp;gt;counter&lt;/span&gt;&lt;/tt&gt;.&lt;/p&gt;
&lt;p&gt;By the way, whenever you're curious about object layouts and want to verify your understanding of the ABI, I find &lt;a class="reference external" href="https://eli.thegreenplace.net/2012/12/17/dumping-a-c-objects-memory-layout-with-clang/"&gt;Clang's ability to dump the class record layouts&lt;/a&gt; very helpful. In this case:&lt;/p&gt;
&lt;div class="highlight" style="background: #ffffff"&gt;&lt;pre style="line-height: 125%"&gt;*** Dumping AST Record Layout
   0 | class DynamicImplementation
   0 |   class DynamicInterface (primary base)
   0 |     (DynamicInterface vtable pointer)
   8 |   uint64_t counter
     | [sizeof=16, dsize=16, align=8
     |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
   0 | class CRTPImplementation
   0 |   class CRTPInterface&amp;lt;class CRTPImplementation&amp;gt; (base) (empty)
   0 |   uint64_t counter
     | [sizeof=8, dsize=8, align=8
     |  nvsize=8, nvalign=8]
&lt;/pre&gt;&lt;/div&gt;
&lt;p&gt;On to the invocation of &lt;tt class="docutils literal"&gt;tick&lt;/tt&gt; now. This is the disassembly for &lt;tt class="docutils literal"&gt;run_dynamic&lt;/tt&gt;, annotated with comments:&lt;/p&gt;
&lt;div class="highlight" style="background: #ffffff"&gt;&lt;pre style="line-height: 125%"&gt;&lt;span style="color: #007f7f"&gt;0000000000400&lt;/span&gt;c10 &amp;lt;_Z11run_dynamicP16DynamicInterface&amp;gt;:
  &lt;span style="color: #007f7f"&gt;400&lt;/span&gt;c10:       push   %r13
  &lt;span style="color: #007f7f"&gt;400&lt;/span&gt;c12:       mov    $0x1,%r13d
  &lt;span style="color: #007f7f"&gt;400&lt;/span&gt;c18:       push   %r12
        &lt;span style="color: #007f00"&gt;// r12d holds i, initialized to 0&lt;/span&gt;
  &lt;span style="color: #007f7f"&gt;400&lt;/span&gt;c1a:       xor    %r12d,%r12d
  &lt;span style="color: #007f7f"&gt;400&lt;/span&gt;c1d:       push   %rbp
